Don't allow to rotate a horizontal cable tray/conduit like this
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NotAllowedCableTrayConduitRotation { get; }
  Visual Basic
Public Shared ReadOnly Property NotAllowedCableTrayConduitRotation As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NotAllowedCableTrayConduitRotation {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures ElectricalFailures Class
  Autodesk.Revit.DB Namespace